ArteryTek/platform-arterytekat32/misc/svd/AT32F455xx_v2.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USB_OTG1_PWRCLK</name>
      <description>USB on the go full speed</description>
      <groupName>USB_OTGFS</groupName>
      <baseAddress>0x50000E00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PCGCCTL</name>
          <displayName>PCGCCTL</displayName>
          <description>OTGFS power and clock gating control
          register (OTGFS_PCGCCTL)</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STOPPCLK</name>
              <description>Stop PHY clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUSPENDM</name>
              <description>PHY Suspended</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SCFG</name>
      <description>System configuration controller</description>
      <groupName>SCFG</groupName>
      <baseAddress>0x40013800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CFG1</name>
          <displayName>CFG1</displayName>
          <description>configuration register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MEM_MAP_SEL</name>
              <description>Memory address mapping selection bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>IR_POL</name>
              <description>IR output polarity selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IR_SRC_SEL</name>
              <description>IR signal source selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SWAP_XMC</name>
              <description>XMC address mapping swap</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWAP_QSPI</name>
              <description>QSOU address mapping swap</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG2</name>
          <displayName>CFG2</displayName>
          <description>configuration register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
			<field>
              <name>LOCKUP_LK</name>
              <description>cm4f lockup config</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>SRAM_OPERR_LK</name>
              <description>SRAM odd parity error lock config</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>PVM_LK</name>
              <description>PVM lock config</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>SRAM_OPE_STS</name>
              <description>SRAM odd parity error status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MII_RMII_SEL</name>
              <description>MII or RMII selection
              bits</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>CAN1_TST_SEL</name>
              <description>CAN1 timestamp counting source select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>CAN2_TST_SEL</name>
              <description>CAN2 timestamp counting source select</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>CAN3_TST_SEL</name>
              <description>CAN3 timestamp counting source select</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXINTC1</name>
          <displayName>EXINTC1</displayName>
          <description>external interrupt configuration register 1</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>EXINT3</name>
              <description>EXINT 3 configuration bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXINT2</name>
              <description>EXINT 2 configuration bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXINT1</name>
              <description>EXINT 1 configuration bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXINT0</name>
              <description>EXINT 0 configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXINTC2</name>
          <displayName>EXINTC2</displayName>
          <description>external interrupt configuration register 2</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>EXINT7</name>
              <description>EXINT 7 configuration bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXINT6</name>
              <description>EXINT 6 configuration bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXINT5</name>
              <description>EXINT 5 configuration bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXINT4</name>
              <description>EXINT 4 configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXINTC3</name>
          <displayName>EXINTC3</displayName>
          <description>external interrupt configuration register 3</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>EXINT11</name>
              <description>EXINT 11 configuration bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXINT10</name>
              <description>EXINT 10 configuration bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXINT9</name>
              <description>EXINT 9 configuration bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXINT8</name>
              <description>EXINT 8 configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXINTC4</name>
          <displayName>EXINTC4</displayName>
          <description>external interrupt configuration register
          4</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>EXINT15</name>
              <description>EXINT 15 configuration bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXINT14</name>
              <description>EXINT 14 configuration bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXINT13</name>
              <description>EXINT 13 configuration bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXINT12</name>
              <description>EXINT 12 configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UHDRV</name>
          <displayName>UHDRV</displayName>
          <description>Ultra high drive register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>PD15_UH</name>
              <description>PD15 ultra high sourcing/sinking strength</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PD14_UH</name>
              <description>PD14 ultra high sourcing/sinking strength</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PD13_UH</name>
              <description>PD13 ultra high sourcing/sinking strength</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PD12_UH</name>
              <description>PD12 ultra high sourcing/sinking strength</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB9_UH</name>
              <description>PB9 ultra high sourcing/sinking strength</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB8_UH</name>
              <description>PB8 ultra high sourcing/sinking strength</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
