ArteryTek/platform-arterytekat32/misc/svd/AT32F455xx_v2.svd
      </registers>
    </peripheral>
	<peripheral>
      <name>TRNG</name>
      <description>True Random Number Generator</description>
      <groupName>TRNG</groupName>
      <baseAddress>0x50060800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TRNG</name>
        <description>AES global interrupt</description>
        <value>80</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <displayName>CTRL</displayName>
          <description>Control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00200000</resetValue>
          <fields>
            <field>
              <name>PRGLK</name>
              <description>Programing register lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CUDIS</name>
              <description>Conditioning unit and output buffer disable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FESCLR</name>
              <description>Clock fail event and entropy source fail event status clear</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HT0</name>
              <description>Health test parameter 0</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>Noise source clock divider factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DTRIE</name>
              <description>Data port ready interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FIE</name>
              <description>Fail interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NSEN</name>
              <description>Noise source enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>            
          </fields>
        </register>
        <register>
          <name>STS</name>
          <displayName>STS</displayName>
          <description>Status register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ESFIS</name>
              <description>Entropy source fail interrupt status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKFIS</name>
              <description>Clock fail interrupt status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ESFES</name>
              <description>Entropy source fail event status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKFES</name>
              <description>Clock fail event status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTRDY</name>
              <description>Data port ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>            
          </fields>
        </register>
		<register>
          <name>DT</name>
          <displayName>DT</displayName>
          <description>Data port</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>HTCTRL</name>
          <displayName>HTCTRL</displayName>
          <description>Health test controller</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00042CE8</resetValue>
          <fields>
		    <field>
			  <name>HT1</name>
              <description>Health test parameter 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
			</field>
		  </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
